{
   "questions":[
      {
         "title":"Qu'est-ce que le Terminal Installer ?",
         "message":"Le Terminal Installer rend le plus simplement possible l'instalation du framework Xposed sur les appareils sous Lollipop ou plus qui N'ONT PAS de custom recovery d'installé! "
      },
      {
         "title":"Comment: utiliser le Terminal Installer ?",
         "message":"Si vous souhaitez installer ou désinstaller le framework Xposed allez dans "TXI" dans la barre de navigation en bas ou dans la barre de navigation et choisissez l'option que vous souhaitez utiliser"
      },
      {
         "title":"Qu'est-ce qu'Xposed ?",
         "message":"Si vous ne savez vraiment pas ce que c'est, voici un petit résumé de ce propose Xposed....C'est juste un outil qui permet de rajouter des "modules", qui permettent de modifier le système en rajoutant de nombreuse fonctionnalitées qui ne sont PAS disponible dans la rom stock"
      },
      {
         "title":"Pourquoi cette application requiert le root ?",
         "message":"Vous ne croirez pas le nombre de fois où cela a été demandé... Afin de "flash" le système, mon outil a besoin d'un accès root sinon le script pour installer / désinstaller ne fonctionnerait PAS!
      },
      {
         "title":"Ai-je besoin d'un custom recovery pour l'utiliser ?",
         "message":"La principale raison pour laquelle j'ai développé cet outils, est que mon LG K7 n'avais pas de custom recovery.. Donc vous n'en avez PAS besoin, mais je vous RECOMMANDE d'en avoir un AU PLUS VITE!"
      },
      {
         "title":"Est-ce que cela peut brick mon appareil ?",
         "message":"Toute application requierant le root peut brick ou soft-brique un appareil, mais je me suis assuré de bloquer chaque appareil qui ne serait PAS compatible avec Xposed... Cepandant le framework Xposed peut brique un appareil si vous essayez de l'installer avec une version incompatible ou sur un appareil incompatible."
      },
      {
         "title":"Quels appareils sont supportés ?",
         "message":"Seul les appareils supportant arm, arm64, ou x86 ABI's....Cependant, quelques appareils Sony ou Dell ne sont pas compatible avec Xposed."
      },
      {
         "title":"J'ai un appareil Dell...Comment être sur qu'il fonctionnera toujours ?",
         "message":"J'écrit un morceau de code pour analyser l'appareil... Tout le test constiste à vérifier le SDK et un scrip est lancé pour comparer la version du fichier au SDK qu'il est supposé correspondre..."
      },
      {
         "title":"Allez-vous rendre compatible les appareils Sony ?",
         "message":"Pas pour l'instant car beaucoup d'appareils SONY ont été brick et il est difficile de bloquer ses appareils ou de créer un test, mais dès qu'Xposed sera plus stable je ne vous oublierais pas!"
      },
      {
         "title":"Allez-vous rendre compatible les appareils Samsung",
         "message":"D'abord oui, J'ai été mal informé sur les appareils qui ne sont pas prit en charge entièrement...Je suis entrain de faire ma propre investigation pour trouver des informations fiables concernant Samsung...Vous n'avez juste qu'à attendre!"
      },
      {
         "title":"Comment signaler des problèmes ?",
         "message":"Si vous avez trouvé des bugs, allez dans "gérer" puis "Comment signaler les problèmes?" OU si l'aaplication crash, une faois relancée un message vous dempandera si vous souhaitez signaler ce problème!"
      },
      {
         "title":"Qu'est ce que Vérification XP Installer & Redémarrer ? "
         "message":"Cela vérifie votre version d'Xposed et si c'est compatible, et un option de redémarrage vous est proposé"
      },
      {
         "title":"Pourquoi dois-je accepter EULA ?",
         "message":"La possibilité que l'outils crash ou bloque est plausible... Je ne serais PAS tenu responsable lorque vous utilisez cet outil pour Xposed car cette application est encore EXPERIMENTALE et qu'un certain nombre de sénarios peuvent brique votre appareil."
      },
      {
         "title":"Pourquoi receuillir les informations de mon appareil si je reporte un problème ?",
         "message":"La plupart des personnes oublient d'ajouter de telles information telles que la verion du SDK, le fabriquant; etc..  Qui sont très utiles lorques vous essayez de résoudre les problèmes et de débuger!"
      },
      {
         "title":"Je ne dispose PAS d'un compte Github.. Puis-je signaler les problèmes ?",
         "message":"Lorsque vous signalez des problèmes appuyez simplement sur le boutons pour valider et je recevrais vos information et votre problème!"
      },
      {
         "title":"Si je brique mon appareil ?",
         "message":"Si vous signalez un problème sur Github, déclarant que votre appareil est brique, je vais essayer de vous aider a restaurer votre appareil , mais RIEN n'est garanti !."
      },
      {
         "title":"Où puis-je trouver une version compatible de xposedinstaller.apk ?",
         "message":"Vous pouvez trouver l'apk sur le site officiel de XDA Dévelloper, ne téléharger pas le script mais juste la version expérimentale."
      },
      {
         "title":"Allez-vous soutenir les futures versions du framework d'Xposed?",
         "message":"Oui, jusqu'à que ce que cet outils d'instalation soit asser stable ou que chaque appareil dispose d'un custom recovery."
      },
      {
         "title":"Allez vous soutenir les appareils incompatibles ?",
         "message":"Je vais essayer de concevoir des moyens de lutter contre les appareils incompatibles."
      },
      {
         "title":"Acceptez vous les donations?",
         "message":"Oui, ce sera très apprécié.. Je vais bientôt ajouter cette possibilité dans les options d'application!"
      }
   ]
}
